def print_menu():
    print('Меню работы с телефонным справочником\n'
          '1. Открыть файл\n'
          '2. Сохранить файл\n'
          '3. Показать контакты\n'
          '4. Добавить контакт\n'
          '5. Изменить контакт\n'
          '6. Найти контакт\n'
          '7. Удалить контакт\n'
          '8. Выход')


def get_number():
    while True:
        what_to_do = input('Введите номер соответствующего действия\n')
        if what_to_do.isdigit() and (0 < int(what_to_do) < 9):
            return int(what_to_do)
